app/Controllers/Leaderboard.php

SELECT *
FROM `leaderboard`
---
    public function getleaderboard()
    {
        $LeaderboardModel = new LeaderboardModel();
        $response = $LeaderboardModel->findAll();

SELECT *
FROM `leaderboard`
ORDER BY `score` DESC
---
    public function leaderboard()
    {
        $LeaderboardModel = new LeaderboardModel();
        $response["leaderboard"] = $LeaderboardModel->orderBy("score","DESC")->findAll();