app/Controllers/Quest.php

    public function getriddle()
    {
        $session = $this->startSession();
        if($session->get('session') == NULL)
        {
            return $this->response->setJSON(['status' => 0, 'msg' => 'No session found. No quest in play']);
        }
        $return = null;
        if (isset($session->get('qorder')[$session->get('qnum')]))
        {
            $return = $this->QuestModel->select('qnum, riddle')->where(['qnum' => $session->get('qorder')[$session->get('qnum')], 'category' => $session->get('category')])->first();
        }
        if(!$return)
        {
            $this->questsessiontodb();
            return $this->response->setJSON(['status' => 0, 'msg' => 'Your have reached the end of the quest, congratulations! ...', 'final score' => $session->get('score')]);
---
SELECT `qnum`, `riddle`
FROM `quest`
WHERE `qnum` = 9
AND `category` = 'quest'
 LIMIT 1
SELECT `qnum`, `riddle`
FROM `quest`
WHERE `qnum` = 5
AND `category` = 'qu3st'
 LIMIT 1

    public function solveriddle($solution = false)
    {
        if (!$solution)
        return $this->response->setJSON(['status' => 1, 'msg' => 'missing parameter: solution']);
        $session = $this->startSession();
        $riddle = $this->QuestModel->where(['qnum' => $session->get('qorder')[$session->get('qnum')], 'category' => $session->get('category')])->first();

        if($riddle['solution'] == $solution)
        // $pattern = '/'.$solution.'/i';			THIS IS A BAD IDEA SEEK BETTER SOLUTION
        // if (
	//  	(strlen($solution) > strlen($riddle['solution'])*0.67) &&
	//	(preg_match($pattern, $riddle['solution']))
	//)
        {
            $score = $session->get('score') + $riddle['points'];
            $qnum = $session->get('qnum') + 1;
---
SELECT *
FROM `quest`
WHERE `qnum` = 3
AND `category` = 'quest'
 LIMIT 1
SELECT *
FROM `quest`
WHERE `qnum` = 5
AND `category` = 'qu3st'
 LIMIT 1

    public function gethighscores (/*$category = false*/)
    {
        $this->QHighScoreModel->orderby('score', 'DESC');
---
SELECT *
FROM `qhighscores`
ORDER BY `score` DESC